# დავალება1:
# შექმენით ოთხი მათემატიკური ფუნქცია, თითოეულს გადაეცით ორი არგუმენტი და სახელის შესაბამისად მოახდინეთ მუშაობა. ოპერაციები: +, -, *, /.

# def num(c,z):
#     print(c + z)
# num(123,21)

# def num(x,y):
#     print(x * y)
# num(11,5)

# def num(x,y):
#     print(x % y)
# num(531,12342)

# def num(x,y):
#     print(x - y)
# num(121,2312)



# დავალება2:
# შექმენით ფუნქცია, რომელსაც გადასცემთ მართკუთხედის სიგრძესა და სიმაღლეს, გამოითვლით მის ფართობს.

# def rectangle(X,Y): #X= lenght    #Y=height
#     print(X*Y)
# rectangle(5,6)



# დავალება3:
# შექმენით ფუნქცია რომლითაც გამიტანთ10ჯერ "Goa best"

# for i in range(0,10):
#     print("GOA IS THE BEST")


# დავალება4:
# შექმენით ფუნქცია რომელსაც გადასცემთ მართკუთდხედის ოთხ გვერდს და გამოიტანეთ მისი პერიმეტრი

# def rectangle(x,y,z,a):
#    print(x + y + z + a)
# rectangle(1,2,3,4)

# დავალება 5
#  დაწერეთ პირობითი დებულება, რომელიც ამოწმებს არის თუ არა რიცხვი 10-ზე მეტი. თუ ასეა, დაბეჭდეთ „რიცხვი მეტია 10-ზე“; წინააღმდეგ შემთხვევაში დაბეჭდეთ „რიცხვი არ არის 10-ზე მეტი“.


# def GOA(a):
#    if a > 10:
#       print("რიცხვი მეტია 10-ზე")
#       if a < 10:
#          print("რიცხვი ნაკლებია 10-ზე")
#          GOA(9)


